In [2]:
import pandas as pd
import numpy as np

data=pd.Series(np.random.randn(9),index=[["a","a","a","b","b","c","c","d","d"],[1,2,3,1,3,1,2,2,3]])

In [4]:
data

a  1    0.228350
   2   -0.495980
   3   -0.229370
b  1    0.021295
   3    1.139478
c  1    0.272498
   2    1.059763
d  2   -0.991872
   3   -0.567292
dtype: float64

In [5]:
data.index

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 3),
            ('b', 1),
            ('b', 3),
            ('c', 1),
            ('c', 2),
            ('d', 2),
            ('d', 3)],
           )

In [6]:
data["b"]

1    0.021295
3    1.139478
dtype: float64

In [7]:
data["b":"c"]

b  1    0.021295
   3    1.139478
c  1    0.272498
   2    1.059763
dtype: float64

In [8]:
data.loc[:,2]

a   -0.495980
c    1.059763
d   -0.991872
dtype: float64

In [10]:
data

a  1    0.228350
   2   -0.495980
   3   -0.229370
b  1    0.021295
   3    1.139478
c  1    0.272498
   2    1.059763
d  2   -0.991872
   3   -0.567292
dtype: float64

In [9]:
data.unstack()

          1         2         3
a  0.228350 -0.495980 -0.229370
b  0.021295       NaN  1.139478
c  0.272498  1.059763       NaN
d       NaN -0.991872 -0.567292

In [11]:
data.unstack().stack()

a  1    0.228350
   2   -0.495980
   3   -0.229370
b  1    0.021295
   3    1.139478
c  1    0.272498
   2    1.059763
d  2   -0.991872
   3   -0.567292
dtype: float64

#heirarchichal indexing Dataframes:

In [26]:
frame=pd.DataFrame(np.arange(12).reshape((4,3)),
                   index=[["a","a","b","b"],[1,2,1,2]],
                   columns=[["Ohio","Ohio","Colorado"],
                            ["Green","Red","Green"]])

In [27]:
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [28]:
frame.index.names=["key1","key2"]

In [29]:
frame.columns.names=["state","color"]

In [30]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [33]:
frame["Ohio"]

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

In [34]:
frame["Colorado"]

color      Green
key1 key2
a    1         2
     2         5
b    1         8
     2        11

In [31]:
frame.swaplevel("key1","key2")

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [32]:
frame.sort_index(level=1)

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [36]:
frame.swaplevel(0,1).sort_index(level=0)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

In [37]:
frame.swaplevel(0)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [39]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [43]:
frame.swaplevel(1)

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [44]:
frame.swaplevel(0)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [48]:
frame.swaplevel(0).sort_index(level=1)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [52]:
frame.swaplevel(0).sort_index(level=0)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

In [56]:
frame.swaplevel(0,1).sort_index(level=0)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

In [57]:
frame.sum(level="key2")

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [59]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [58]:
frame.sum(level="key1")

state  Ohio     Colorado
color Green Red    Green
key1
a         3   5        7
b        15  17       19

In [61]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [60]:
frame.sum(level="color",axis=1)

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

#Indexing with DataFrame's columns

In [18]:
frame=pd.DataFrame({"a":range(7),"b":range(7,0,-1),
                   "c":["one","one","one","two","two","two","two"],
                   "d":[0,1,2,0,1,2,3]})

In [19]:
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [20]:
frame2=frame.set_index(["c","d"])

In [21]:
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [66]:
frame=pd.DataFrame({"a":range(7),"b":range(7,0,-1),
                   "c":["one","one","one","two","two","two","two"],
                   "d":[0,1,2,0,1,2,3]})

In [67]:
frame.set_index(["c","d"],drop=False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [69]:
frame2.reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1

In [4]:
import pandas as pd
import numpy as np

df=pd.DataFrame(np.random.random(12).reshape((3,4)),index=[2000,2001,2002],columns=["Munich","Stuttgart","Colonge","Berlin"])

In [5]:
df

        Munich  Stuttgart   Colonge    Berlin
2000  0.303999   0.157654  0.232871  0.182416
2001  0.534410   0.098008  0.527551  0.694989
2002  0.908655   0.786306  0.557173  0.714980

In [7]:
df["Frankfurt"]=np.random.random(3)

In [8]:
df

        Munich  Stuttgart   Colonge    Berlin  Frankfurt
2000  0.303999   0.157654  0.232871  0.182416   0.317131
2001  0.534410   0.098008  0.527551  0.694989   0.736171
2002  0.908655   0.786306  0.557173  0.714980   0.475370

In [9]:
df.index=["pop","emp","edu"]

In [10]:
df

       Munich  Stuttgart   Colonge    Berlin  Frankfurt
pop  0.303999   0.157654  0.232871  0.182416   0.317131
emp  0.534410   0.098008  0.527551  0.694989   0.736171
edu  0.908655   0.786306  0.557173  0.714980   0.475370

In [ ]:
#concatenating along an axis:

In [11]:
arr=np.arange(12).reshape(3,4)

In [12]:
arr

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [14]:
np.concatenate([arr,arr],axis=1)

array([[ 0,  1,  2,  3,  0,  1,  2,  3],
       [ 4,  5,  6,  7,  4,  5,  6,  7],
       [ 8,  9, 10, 11,  8,  9, 10, 11]])

#panads uses concat function,suppose we have three series without Index overlap.

In [19]:
s1=pd.Series([0,1],index=["a","b"])

In [20]:
s2=pd.Series([2,3,4],index=["c","d","e"])

In [21]:
s3=pd.Series([5,6],index=["f","g"])

In [23]:
pd.concat([s1,s2,s3])

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

In [24]:
pd.concat([s1,s2,s3],axis=1)

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

     0    1    2
a  0.0  NaN  NaN
b  1.0  NaN  NaN
c  NaN  2.0  NaN
d  NaN  3.0  NaN
e  NaN  4.0  NaN
f  NaN  NaN  5.0
g  NaN  NaN  6.0

In [26]:
s11=pd.Series([0,1,8],index=["a","b","c"])

In [27]:
s12=pd.Series([2,3,4,1],index=["c","d","e","f"])

In [28]:
s13=pd.Series([5,7,9,3],index=["a","b","e","g"])

In [29]:
pd.concat([s11,s12,s13])

a    0
b    1
c    8
c    2
d    3
e    4
f    1
a    5
b    7
e    9
g    3
dtype: int64

In [30]:
pd.concat([s11,s12,s13],axis=1)

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

     0    1    2
a  0.0  NaN  5.0
b  1.0  NaN  7.0
c  8.0  2.0  NaN
d  NaN  3.0  NaN
e  NaN  4.0  9.0
f  NaN  1.0  NaN
g  NaN  NaN  3.0

In [32]:
s4=pd.concat([s1,s3])
s4

a    0
b    1
f    5
g    6
dtype: int64

In [33]:
pd.concat([s1,s4],axis=1)

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

     0  1
a  0.0  0
b  1.0  1
f  NaN  5
g  NaN  6

In [34]:
pd.concat([s1,s4],axis=1,join="inner")

   0  1
a  0  0
b  1  1

In [36]:
pd.concat([s1,s4],axis=1)

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

     0  1
a  0.0  0
b  1.0  1
f  NaN  5
g  NaN  6

In [35]:
pd.concat([s1,s4],axis=1,join_axes=[["a","c","b","d"]])

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: The join_axes-keyword is deprecated. Use .reindex or .reindex_like on the result to achieve the same functionality.
  """Entry point for launching an IPython kernel.

     0    1
a  0.0  0.0
c  NaN  NaN
b  1.0  1.0
d  NaN  NaN

In [40]:
s1

a    0
b    1
dtype: int64

In [55]:
sf=pd.concat([s1,s4],axis=1)
sf.columns=["s1","s4"]
sf

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

    s1  s4
a  0.0   0
b  1.0   1
f  NaN   5
g  NaN   6

In [57]:
pd.concat([s1,s4],axis=1,join_axes=[["a","c","b","d"]])

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: The join_axes-keyword is deprecated. Use .reindex or .reindex_like on the result to achieve the same functionality.
  """Entry point for launching an IPython kernel.

     0    1
a  0.0  0.0
c  NaN  NaN
b  1.0  1.0
d  NaN  NaN

In [59]:
result=pd.concat([s1,s1,s3],keys=["one","two","three"])

In [60]:
result

one    a    0
       b    1
two    a    0
       b    1
three  f    5
       g    6
dtype: int64

In [61]:
pd.concat([s1,s1,s3])

a    0
b    1
a    0
b    1
f    5
g    6
dtype: int64

In [62]:
result.unstack()

         a    b    f    g
one    0.0  1.0  NaN  NaN
two    0.0  1.0  NaN  NaN
three  NaN  NaN  5.0  6.0

In [64]:
pd.concat([s1,s2,s3],axis=1,keys=["one","two","three"])

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

   one  two  three
a  0.0  NaN    NaN
b  1.0  NaN    NaN
c  NaN  2.0    NaN
d  NaN  3.0    NaN
e  NaN  4.0    NaN
f  NaN  NaN    5.0
g  NaN  NaN    6.0

In [65]:
df1=pd.DataFrame(np.arange(6).reshape(3,2), index=["a","b","c"],columns=["one","two"])

In [66]:
df2=pd.DataFrame(5+np.arange(4).reshape(2,2), index=["a","c"],columns=["three","four"])

In [67]:
df1

   one  two
a    0    1
b    2    3
c    4    5

In [68]:
df2

   three  four
a      5     6
c      7     8

In [73]:
result=pd.concat([df1,df2],axis=1,keys=["level1","level2"])

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

In [74]:
result.unstack()

level1  one    a    0.0
               b    2.0
               c    4.0
        two    a    1.0
               b    3.0
               c    5.0
level2  three  a    5.0
               b    NaN
               c    7.0
        four   a    6.0
               b    NaN
               c    8.0
dtype: float64

In [76]:
pd.concat({"level1":df1,"level2":df2},axis=1)

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

  level1     level2
     one two  three four
a      0   1    5.0  6.0
b      2   3    NaN  NaN
c      4   5    7.0  8.0

In [78]:
pd.concat([df1,df2],axis=1,keys=["level1","level2"],names=["upper","lower"],sort=False)

upper level1     level2
lower    one two  three four
a          0   1    5.0  6.0
b          2   3    NaN  NaN
c          4   5    7.0  8.0

In [79]:
df1=pd.DataFrame(np.random.randn(3,4),columns=["a","b","c","d"])

In [80]:
df2=pd.DataFrame(np.random.randn(2,3),columns=["b","d","a"])

In [81]:
df1

          a         b         c         d
0  0.225084 -0.578913  0.987629  1.208140
1  0.403409 -1.093078  1.088976 -0.671901
2  0.671601 -2.087185 -0.354886  1.193728

In [82]:
df2

          b         d         a
0  1.735643  1.550144  1.280956
1  0.330501  0.694001 -0.845118

In [83]:
pd.concat([df1,df2])

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

          a         b         c         d
0  0.225084 -0.578913  0.987629  1.208140
1  0.403409 -1.093078  1.088976 -0.671901
2  0.671601 -2.087185 -0.354886  1.193728
0  1.280956  1.735643       NaN  1.550144
1 -0.845118  0.330501       NaN  0.694001

In [85]:
pd.concat([df1,df2],ignore_index=True)

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

          a         b         c         d
0  0.225084 -0.578913  0.987629  1.208140
1  0.403409 -1.093078  1.088976 -0.671901
2  0.671601 -2.087185 -0.354886  1.193728
3  1.280956  1.735643       NaN  1.550144
4 -0.845118  0.330501       NaN  0.694001

In [86]:
a=pd.Series([np.nan,2.5,0.0,3.5,4.5,np.nan],index=["f","e","d","c","b","a"])

In [87]:
b=pd.Series([0.,np.nan,2.,np.nan,np.nan,5.],index=["a","b","c","d","e","f"])

In [88]:
a

f    NaN
e    2.5
d    0.0
c    3.5
b    4.5
a    NaN
dtype: float64

In [89]:
b

a    0.0
b    NaN
c    2.0
d    NaN
e    NaN
f    5.0
dtype: float64

In [95]:
np.where(pd.isnull(a))

(array([0, 5], dtype=int64),)

#a mask of [True,False,False,False,True] is applied on b to give output:[0,5]

In [90]:
np.where(pd.isnull(a),b,a)

array([0. , 2.5, 0. , 3.5, 4.5, 5. ])

In [113]:
b.combine_first(a)

a    0.0
b    4.5
c    2.0
d    0.0
e    2.5
f    5.0
dtype: float64

In [100]:
pd.concat([df1,df2],axis=1,sort=False,ignore_index=True)

          0         1         2         3         4         5         6
0  0.225084 -0.578913  0.987629  1.208140  1.735643  1.550144  1.280956
1  0.403409 -1.093078  1.088976 -0.671901  0.330501  0.694001 -0.845118
2  0.671601 -2.087185 -0.354886  1.193728       NaN       NaN       NaN

#combine_first method:It is same a patching missing data in the calling object with data from the object you pass.

In [101]:
b.combine_first(a)

a    0.0
b    4.5
c    2.0
d    0.0
e    2.5
f    5.0
dtype: float64

In [114]:
a.combine_first(b)

a    0.0
b    4.5
c    3.5
d    0.0
e    2.5
f    5.0
dtype: float64

In [102]:
df3=pd.DataFrame({"a":[1.,np.nan,5.,np.nan],
                  "b":[np.nan,2.,np.nan,6.],
                  "c":range(2,18,4)})

In [103]:
df4=pd.DataFrame({"a":[5.,4.,np.nan,3.,7.],
                  "b":[np.nan,3.,4.,6.,8.]})

In [110]:
df3

     a    b   c
0  1.0  NaN   2
1  NaN  2.0   6
2  5.0  NaN  10
3  NaN  6.0  14

In [111]:
df4

     a    b
0  5.0  NaN
1  4.0  3.0
2  NaN  4.0
3  3.0  6.0
4  7.0  8.0

In [115]:
df3.combine_first(df4)

     a    b     c
0  1.0  NaN   2.0
1  4.0  2.0   6.0
2  5.0  4.0  10.0
3  3.0  6.0  14.0
4  7.0  8.0   NaN

In [116]:
df4.combine_first(df3)

     a    b     c
0  5.0  NaN   2.0
1  4.0  3.0   6.0
2  5.0  4.0  10.0
3  3.0  6.0  14.0
4  7.0  8.0   NaN

In [118]:
np.where(pd.isnull(a),b,a)

array([0. , 2.5, 0. , 3.5, 4.5, 5. ])

In [ ]:
#reshaping and pivoting

In [ ]:
#stack=this"rotates" or pivots from the columns in the data to the rows

In [ ]:
#unstack=this pivots from rows into the columns

In [120]:
data=pd.DataFrame(np.arange(6).reshape((2,3)),index=pd.Index(["Ohio","Colorado"],name="state"),columns=pd.Index(["one","two","three"],name="number"))

In [121]:
data

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [122]:
result=data.stack()

In [123]:
result

state     number
Ohio      one       0
          two       1
          three     2
Colorado  one       3
          two       4
          three     5
dtype: int32

In [124]:
result.unstack()

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

#stack() results in a Series. unstack() can be used to rearrange the data back into a DataFrame.

In [126]:
result

state     number
Ohio      one       0
          two       1
          three     2
Colorado  one       3
          two       4
          three     5
dtype: int32

In [125]:
result.unstack(0)

state   Ohio  Colorado
number
one        0         3
two        1         4
three      2         5

In [127]:
result.unstack(1)

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [128]:
result.unstack()

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [129]:
result.unstack("state")

state   Ohio  Colorado
number
one        0         3
two        1         4
three      2         5

In [131]:
result

state     number
Ohio      one       0
          two       1
          three     2
Colorado  one       3
          two       4
          three     5
dtype: int32

#Unstacking introduces missing data if all of the values in the level aren't found in each subgroups:

In [132]:
s1=pd.Series([0,1,2,3],index=["a","b","c","d"])

In [133]:
s2=pd.Series([4,5,6],index=["c","d","e"])

In [134]:
data2=pd.concat([s1,s2],keys=["one","two"])

In [135]:
data2

one  a    0
     b    1
     c    2
     d    3
two  c    4
     d    5
     e    6
dtype: int64

In [136]:
data2.unstack() #make a DataFrame out of the Series

       a    b    c    d    e
one  0.0  1.0  2.0  3.0  NaN
two  NaN  NaN  4.0  5.0  6.0

In [138]:
data2.unstack().stack() #stacking filters out missing data by default

one  a    0.0
     b    1.0
     c    2.0
     d    3.0
two  c    4.0
     d    5.0
     e    6.0
dtype: float64

In [139]:
data2.unstack().stack(dropna=False) #stacking with missing data

one  a    0.0
     b    1.0
     c    2.0
     d    3.0
     e    NaN
two  a    NaN
     b    NaN
     c    4.0
     d    5.0
     e    6.0
dtype: float64

In [142]:
result

state     number
Ohio      one       0
          two       1
          three     2
Colorado  one       3
          two       4
          three     5
dtype: int32

In [140]:
df=pd.DataFrame({"left":result,"right":result+5},
                columns=pd.Index(["left","right"],name="side"))

In [141]:
df

side             left  right
state    number
Ohio     one        0      5
         two        1      6
         three      2      7
Colorado one        3      8
         two        4      9
         three      5     10

In [143]:
df.unstack("state")

side   left          right
state  Ohio Colorado  Ohio Colorado
number
one       0        3     5        8
two       1        4     6        9
three     2        5     7       10

In [144]:
df.unstack("state").stack("side")

state         Colorado  Ohio
number side
one    left          3     0
       right         8     5
two    left          4     1
       right         9     6
three  left          5     2
       right        10     7

#Pivoting "long" to "Wide" Format

In [3]:
import pandas as pd
import numpy as np


data=pd.read_csv("macrodata.csv")

In [4]:
data

,year,quarter,realgdp,realcons,realinv,realgovt,realdpi,cpi,m1,tbilrate,unemp,pop,infl,realint
0,1959.0,1.0,2710.349,1707.4,286.898,470.045,1886.9,28.980,139.7,2.82,5.8,177.146,0.00,0.00
1,1959.0,2.0,2778.801,1733.7,310.859,481.301,1919.7,29.150,141.7,3.08,5.1,177.830,2.34,0.74
2,1959.0,3.0,2775.488,1751.8,289.226,491.260,1916.4,29.350,140.5,3.82,5.3,178.657,2.74,1.09
3,1959.0,4.0,2785.204,1753.7,299.356,484.052,1931.3,29.370,140.0,4.33,5.6,179.386,0.27,4.06
4,1960.0,1.0,2847.699,1770.5,331.722,462.199,1955.5,29.540,139.6,3.50,5.2,180.007,2.31,1.19
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
198,2008.0,3.0,13324.600,9267.7,1990.693,991.551,9838.3,216.889,1474.7,1.17,6.0,305.270,-3.16,4.33
199,2008.0,4.0,13141.920,9195.3,1857.661,1007.273,9920.4,212.174,1576.5,0.12,6.9,305.952,-8.79,8.91
200,2009.0,1.0,12925.410,9209.2,1558.494,996.287,9926.4,212.671,1592.8,0.22,8.1,306.547,0.94,-0.71
201,2009.0,2.0,12901.504,9189.0,1456.678,1023.528,10077.5,214.469,1653.6,0.18,9.2,307.226,3.37,-3.19
202,2009.0,3.0,12990.341,9256.0,1486.398,1044.088,10040.6,216.385,1673.9,0.12,9.6,308.013,3.56,-3.44

In [7]:
periods=pd.PeriodIndex(year=data.year,quarter=data.quarter,name="date")

In [8]:
periods

PeriodIndex(['1959Q1', '1959Q2', '1959Q3', '1959Q4', '1960Q1', '1960Q2',
             '1960Q3', '1960Q4', '1961Q1', '1961Q2',
             ...
             '2007Q2', '2007Q3', '2007Q4', '2008Q1', '2008Q2', '2008Q3',
             '2008Q4', '2009Q1', '2009Q2', '2009Q3'],
            dtype='period[Q-DEC]', name='date', length=203, freq='Q-DEC')

In [9]:
columns=pd.Index(["realgdp","infl","unemp"],name="item")

In [10]:
columns

Index(['realgdp', 'infl', 'unemp'], dtype='object', name='item')

In [11]:
data=data.reindex(columns=columns)

In [16]:
data.index=periods.to_timestamp("D","end")
data.index

DatetimeIndex(['1959-03-31 23:59:59.999999999',
               '1959-06-30 23:59:59.999999999',
               '1959-09-30 23:59:59.999999999',
               '1959-12-31 23:59:59.999999999',
               '1960-03-31 23:59:59.999999999',
               '1960-06-30 23:59:59.999999999',
               '1960-09-30 23:59:59.999999999',
               '1960-12-31 23:59:59.999999999',
               '1961-03-31 23:59:59.999999999',
               '1961-06-30 23:59:59.999999999',
               ...
               '2007-06-30 23:59:59.999999999',
               '2007-09-30 23:59:59.999999999',
               '2007-12-31 23:59:59.999999999',
               '2008-03-31 23:59:59.999999999',
               '2008-06-30 23:59:59.999999999',
               '2008-09-30 23:59:59.999999999',
               '2008-12-31 23:59:59.999999999',
               '2009-03-31 23:59:59.999999999',
               '2009-06-30 23:59:59.999999999',
               '2009-09-30 23:59:59.999999999'],
              dtype='datetime64[ns]', name='date', length=203, freq='Q-DEC')

In [18]:
data.head()

item                            realgdp  infl  unemp
date
1959-03-31 23:59:59.999999999  2710.349  0.00    5.8
1959-06-30 23:59:59.999999999  2778.801  2.34    5.1
1959-09-30 23:59:59.999999999  2775.488  2.74    5.3
1959-12-31 23:59:59.999999999  2785.204  0.27    5.6
1960-03-31 23:59:59.999999999  2847.699  2.31    5.2

In [13]:
ldata=data.stack().reset_index().rename(columns={0:"value"})

In [14]:
ldata[:10]

                           date     item     value
0 1959-03-31 23:59:59.999999999  realgdp  2710.349
1 1959-03-31 23:59:59.999999999     infl     0.000
2 1959-03-31 23:59:59.999999999    unemp     5.800
3 1959-06-30 23:59:59.999999999  realgdp  2778.801
4 1959-06-30 23:59:59.999999999     infl     2.340
5 1959-06-30 23:59:59.999999999    unemp     5.100
6 1959-09-30 23:59:59.999999999  realgdp  2775.488
7 1959-09-30 23:59:59.999999999     infl     2.740
8 1959-09-30 23:59:59.999999999    unemp     5.300
9 1959-12-31 23:59:59.999999999  realgdp  2785.204

In [19]:
pivoted=ldata.pivot("date","item","value")

In [21]:
pivoted.head()

item                           infl   realgdp  unemp
date
1959-03-31 23:59:59.999999999  0.00  2710.349    5.8
1959-06-30 23:59:59.999999999  2.34  2778.801    5.1
1959-09-30 23:59:59.999999999  2.74  2775.488    5.3
1959-12-31 23:59:59.999999999  0.27  2785.204    5.6
1960-03-31 23:59:59.999999999  2.31  2847.699    5.2

In [22]:
ldata["value2"]=np.random.randn(len(ldata))

In [24]:
ldata.head()

                           date     item     value    value2
0 1959-03-31 23:59:59.999999999  realgdp  2710.349  0.013179
1 1959-03-31 23:59:59.999999999     infl     0.000 -0.204709
2 1959-03-31 23:59:59.999999999    unemp     5.800 -0.609152
3 1959-06-30 23:59:59.999999999  realgdp  2778.801 -0.392359
4 1959-06-30 23:59:59.999999999     infl     2.340 -0.435604

In [26]:
pivoted=ldata.pivot("date","item")

In [27]:
pivoted.head()

                              value                    value2            \
item                           infl   realgdp unemp      infl   realgdp
date
1959-03-31 23:59:59.999999999  0.00  2710.349   5.8 -0.204709  0.013179
1959-06-30 23:59:59.999999999  2.34  2778.801   5.1 -0.435604 -0.392359
1959-09-30 23:59:59.999999999  2.74  2775.488   5.3  1.852259 -0.717241
1959-12-31 23:59:59.999999999  0.27  2785.204   5.6  0.270285  1.043761
1960-03-31 23:59:59.999999999  2.31  2847.699   5.2 -0.613288 -1.204576


item                              unemp
date
1959-03-31 23:59:59.999999999 -0.609152
1959-06-30 23:59:59.999999999  0.155556
1959-09-30 23:59:59.999999999 -1.071618
1959-12-31 23:59:59.999999999 -0.803596
1960-03-31 23:59:59.999999999  1.200503

In [28]:
unstacked=ldata.set_index(["date","item"]).unstack("item")

In [29]:
unstacked.head()

                              value                    value2            \
item                           infl   realgdp unemp      infl   realgdp
date
1959-03-31 23:59:59.999999999  0.00  2710.349   5.8 -0.204709  0.013179
1959-06-30 23:59:59.999999999  2.34  2778.801   5.1 -0.435604 -0.392359
1959-09-30 23:59:59.999999999  2.74  2775.488   5.3  1.852259 -0.717241
1959-12-31 23:59:59.999999999  0.27  2785.204   5.6  0.270285  1.043761
1960-03-31 23:59:59.999999999  2.31  2847.699   5.2 -0.613288 -1.204576


item                              unemp
date
1959-03-31 23:59:59.999999999 -0.609152
1959-06-30 23:59:59.999999999  0.155556
1959-09-30 23:59:59.999999999 -1.071618
1959-12-31 23:59:59.999999999 -0.803596
1960-03-31 23:59:59.999999999  1.200503

In [ ]:
#pivoting "wide" to "long" format

In [47]:
df=pd.DataFrame(np.random.randint(1,10,12).reshape((3,4)),columns=["colorado","Mainz","Leh","Dortmund"],index=["2001","2002","2003"])

In [58]:
df

cities  colorado  Mainz  Leh  Dortmund
2001           2      9    9         9
2002           6      1    2         9
2003           6      3    8         8

In [59]:
columns=pd.Index(["colorado","Mainz","Leh","Dortmund"],name="cities")

In [65]:
df.index=pd.Index(["2001","2002","2003"],name="year")

In [71]:
df=df.reindex(columns=columns)
df

cities  colorado  Mainz  Leh  Dortmund
year
2001           2      9    9         9
2002           6      1    2         9
2003           6      3    8         8

In [67]:
ldf=df.stack().reset_index().rename(columns={0:"value"})

In [68]:
ldf

    year    cities  value
0   2001  colorado      2
1   2001     Mainz      9
2   2001       Leh      9
3   2001  Dortmund      9
4   2002  colorado      6
5   2002     Mainz      1
6   2002       Leh      2
7   2002  Dortmund      9
8   2003  colorado      6
9   2003     Mainz      3
10  2003       Leh      8
11  2003  Dortmund      8

In [69]:
pivoted=ldf.pivot("year","cities","value")

In [70]:
pivoted

cities  Dortmund  Leh  Mainz  colorado
year
2001           9    9      9         2
2002           9    2      1         6
2003           8    8      3         6

In [81]:
ldf["value2"]=np.random.randn(len(ldf))

In [82]:
ldf

    year    cities  value    value2
0   2001  colorado      2  0.152756
1   2001     Mainz      9 -0.638794
2   2001       Leh      9 -1.960871
3   2001  Dortmund      9 -0.226500
4   2002  colorado      6  1.762951
5   2002     Mainz      1 -1.259195
6   2002       Leh      2  0.642214
7   2002  Dortmund      9 -0.320186
8   2003  colorado      6  1.721343
9   2003     Mainz      3 -0.795934
10  2003       Leh      8 -0.589472
11  2003  Dortmund      8 -0.147200

In [83]:
pivoted=ldf.pivot("year","cities")

In [84]:
pivoted

          value                       value2
cities Dortmund Leh Mainz colorado  Dortmund       Leh     Mainz  colorado
year
2001          9   9     9        2 -0.226500 -1.960871 -0.638794  0.152756
2002          9   2     1        6 -0.320186  0.642214 -1.259195  1.762951
2003          8   8     3        6 -0.147200 -0.589472 -0.795934  1.721343

In [85]:
pivoted["value"][:3]

cities  Dortmund  Leh  Mainz  colorado
year
2001           9    9      9         2
2002           9    2      1         6
2003           8    8      3         6

In [86]:
pivoted["value2"][:3]

cities  Dortmund       Leh     Mainz  colorado
year
2001   -0.226500 -1.960871 -0.638794  0.152756
2002   -0.320186  0.642214 -1.259195  1.762951
2003   -0.147200 -0.589472 -0.795934  1.721343

In [89]:
unstacked=ldf.set_index(["year","cities"]).unstack("cities")

In [90]:
unstacked

          value                       value2
cities Dortmund Leh Mainz colorado  Dortmund       Leh     Mainz  colorado
year
2001          9   9     9        2 -0.226500 -1.960871 -0.638794  0.152756
2002          9   2     1        6 -0.320186  0.642214 -1.259195  1.762951
2003          8   8     3        6 -0.147200 -0.589472 -0.795934  1.721343

Pivoting "wide" to "long" Format:

In [91]:
df=pd.DataFrame({"key":["foo","bar","baz"],
                "A":[1,2,3],
                "B":[4,5,6],
                "C":[7,8,9]})

In [92]:
df

   key  A  B  C
0  foo  1  4  7
1  bar  2  5  8
2  baz  3  6  9

In [93]:
melted=pd.melt(df,["key"])

In [94]:
melted

   key variable  value
0  foo        A      1
1  bar        A      2
2  baz        A      3
3  foo        B      4
4  bar        B      5
5  baz        B      6
6  foo        C      7
7  bar        C      8
8  baz        C      9

In [95]:
reshaped=melted.pivot("key","variable","value")

In [96]:
reshaped

variable  A  B  C
key
bar       2  5  8
baz       3  6  9
foo       1  4  7

In [97]:
reshaped.reset_index()

variable  key  A  B  C
0         bar  2  5  8
1         baz  3  6  9
2         foo  1  4  7

In [98]:
pd.melt(df,id_vars=["key"],value_vars=["A","B"])

   key variable  value
0  foo        A      1
1  bar        A      2
2  baz        A      3
3  foo        B      4
4  bar        B      5
5  baz        B      6

In [99]:
pd.melt(df,value_vars=["A","B","C"])

  variable  value
0        A      1
1        A      2
2        A      3
3        B      4
4        B      5
5        B      6
6        C      7
7        C      8
8        C      9

In [100]:
pd.melt(df,value_vars=["key","A","B","C"])

   variable value
0       key   foo
1       key   bar
2       key   baz
3         A     1
4         A     2
5         A     3
6         B     4
7         B     5
8         B     6
9         C     7
10        C     8
11        C     9

In [ ]:
;